hw-bdd-new-feature/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "movies" SET "updated_at" = ?, "director" = ? WHERE "movies"."id" = ?  [["updated_at", "2025-10-23 02:05:54.777104"], ["director", "Ridley Scott"], ["id", 3]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update!(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ? AND "movies"."id" != ?  [["director", "George Lucas"], ["id", 1]]
---
  def show_by_director
    @movie = Movie.find(params[:id])

    if @movie.director.blank?